bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant name="ATmega644RFR2-ZU" package="VQFN48" pinout="QFN48" speedmax="16000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="1.8"/>
        <variant name="ATmega644RFR2-ZUR" package="VQFN48" pinout="QFN48" speedmax="16000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="1.8"/>
        <variant name="ATmega644RFR2-ZF" package="VQFN48" pinout="QFN48" speedmax="16000000" tempmax="125" tempmin="-40" vccmax="3.6" vccmin="1.8"/>
        <variant name="ATmega644RFR2-ZFR" package="VQFN48" pinout="QFN48" speedmax="16000000" tempmax="125" tempmin="-40" vccmax="3.6" vccmin="1.8"/>
    </variants>
    <device name="ATmega644RFR2" family="AVR8" architecture="AVR8" avr-family="megaAVR">
        <address-spaces>
            <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x10000">
                <memory-segment start="0x0000" size="0x10000" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x100"/>
                <memory-segment start="0xfc00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1" pagesize="0x100"/>
                <memory-segment start="0xf800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2" pagesize="0x100"/>
                <memory-segment start="0xf000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3" pagesize="0x100"/>
                <memory-segment start="0xe000" size="0x2000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4" pagesize="0x100"/>
            </address-space>
            <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
                <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space endianness="little" name="user_signatures" id="user_signatures" start="0x0100" size="0x0300">
                <memory-segment start="0x0100" size="0x0300" type="user_signatures" rw="RW" exec="0" name="USER_SIGNATURES" pagesize="0x100"/>
            </address-space>
            <address-space endianness="little" name="data" id="data" start="0x0000" size="0x2200">
                <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                <memory-segment name="MAPPED_IO" start="0x0020" size="0x01e0" type="io" external="false"/>
                <memory-segment name="IRAM" start="0x0200" size="0x2000" type="ram" external="false"/>
            </address-space>
            <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0800">
                <memory-segment start="0x0000" size="0x0800" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="0x08"/>
            </address-space>
            <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
                <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="AC">
                <instance name="AC" caption="Analog Comparator">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
                </instance>
            </module>
            <module name="USART">
                <instance name="USART0" caption="USART">
                    <register-group name="USART0" name-in-module="USART0" offset="0x00" address-space="data" caption="USART"/>
                </instance>
                <instance name="USART1" caption="USART">
                    <register-group name="USART1" name-in-module="USART1" offset="0x00" address-space="data" caption="USART"/>
                </instance>
            </module>
            <module name="TWI">
                <instance name="TWI" caption="Two Wire Serial Interface">
                    <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
                </instance>
            </module>
            <module name="SPI">
                <instance name="SPI" caption="Serial Peripheral Interface">
                    <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
                </instance>
                <instance name="USART0_SPI" caption="Serial Peripheral Interface">
                    <register-group name="USART0_SPI" name-in-module="USART0_SPI" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
                </instance>
                <instance name="USART1_SPI" caption="Serial Peripheral Interface">
                    <register-group name="USART1_SPI" name-in-module="USART1_SPI" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
                </instance>
            </module>
            <module name="PORT">
                <instance name="MISSING_PORTA" caption="I/O Port">
                    <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data" caption="I/O Port"/>
                </instance>
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal function="PORTB" group="P" index="0" pad="PB0"/>
                        <signal function="PORTB" group="P" index="1" pad="PB1"/>
                        <signal function="PORTB" group="P" index="2" pad="PB2"/>
                        <signal function="PORTB" group="P" index="3" pad="PB3"/>
                        <signal function="PORTB" group="P" index="4" pad="PB4"/>
                        <signal function="PORTB" group="P" index="5" pad="PB5"/>
                        <signal function="PORTB" group="P" index="6" pad="PB6"/>
                        <signal function="PORTB" group="P" index="7" pad="PB7"/>
                    </signals>
                </instance>
                <instance name="MISSING_PORTC" caption="I/O Port">
                    <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data" caption="I/O Port"/>
