bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
                </instance>
                <instance name="PORTD" caption="I/O Port">
                    <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal function="PORTD" group="P" index="0" pad="PD0"/>
                        <signal function="PORTD" group="P" index="1" pad="PD1"/>
                        <signal function="PORTD" group="P" index="2" pad="PD2"/>
                        <signal function="PORTD" group="P" index="3" pad="PD3"/>
                        <signal function="PORTD" group="P" index="4" pad="PD4"/>
                        <signal function="PORTD" group="P" index="5" pad="PD5"/>
                        <signal function="PORTD" group="P" index="6" pad="PD6"/>
                        <signal function="PORTD" group="P" index="7" pad="PD7"/>
                    </signals>
                </instance>
                <instance name="PORTE" caption="I/O Port">
                    <register-group name="PORTE" name-in-module="PORTE" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal function="PORTE" group="P" index="0" pad="PE0"/>
                        <signal function="PORTE" group="P" index="1" pad="PE1"/>
                        <signal function="PORTE" group="P" index="2" pad="PE2"/>
                        <signal function="PORTE" group="P" index="3" pad="PE3"/>
                        <signal function="PORTE" group="P" index="4" pad="PE4"/>
                        <signal function="PORTE" group="P" index="5" pad="PE5"/>
                        <signal function="PORTE" group="P" index="7" pad="PE7"/>
                    </signals>
                </instance>
                <instance name="PORTF" caption="I/O Port">
                    <register-group name="PORTF" name-in-module="PORTF" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal function="PORTF" group="P" index="0" pad="PF0"/>
                        <signal function="PORTF" group="P" index="1" pad="PF1"/>
                        <signal function="PORTF" group="P" index="2" pad="PF2"/>
                        <signal function="PORTF" group="P" index="3" pad="PF3/4"/>
                        <signal function="PORTF" group="P" index="4" pad="PF4/4"/>
                        <signal function="PORTF" group="P" index="5" pad="PF5"/>
                        <signal function="PORTF" group="P" index="6" pad="PF6"/>
                        <signal function="PORTF" group="P" index="7" pad="PF7"/>
                    </signals>
                </instance>
                <instance name="PORTG" caption="I/O Port">
                    <register-group name="PORTG" name-in-module="PORTG" offset="0x00" address-space="data" caption="I/O Port"/>
                    <signals>
                        <signal function="PORTG" group="P" index="1" pad="PG1"/>
                        <signal function="PORTG" group="P" index="3" pad="PG3"/>
                        <signal function="PORTG" group="P" index="4" pad="PG4"/>
                    </signals>
                </instance>
            </module>
            <module name="TC8">
                <instance name="TC0" caption="Timer/Counter, 8-bit">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
                </instance>
            </module>
            <module name="TC8_ASYNC">
                <instance name="TC2" caption="Timer/Counter, 8-bit Async">
                    <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit Async"/>
                </instance>
            </module>
            <module name="WDT">
                <instance name="WDT" caption="Watchdog Timer">
                    <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data" caption="Watchdog Timer"/>
                </instance>
            </module>
            <module name="TC16">
                <instance name="TC5" caption="Timer/Counter, 16-bit">
                    <register-group name="TC5" name-in-module="TC5" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
                </instance>
                <instance name="TC4" caption="Timer/Counter, 16-bit">
                    <register-group name="TC4" name-in-module="TC4" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
                </instance>
                <instance name="TC3" caption="Timer/Counter, 16-bit">
                    <register-group name="TC3" name-in-module="TC3" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
                </instance>
                <instance name="TC1" caption="Timer/Counter, 16-bit">
                    <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
                </instance>
            </module>
            <module name="TRX24">
                <instance name="TRX24" caption="Low-Power 2.4 GHz Transceiver">
                    <register-group name="TRX24" name-in-module="TRX24" offset="0x00" address-space="data" caption="Low-Power 2.4 GHz Transceiver"/>
                </instance>
            </module>
            <module name="SYMCNT">
                <instance name="SYMCNT" caption="MAC Symbol Counter">
                    <register-group name="SYMCNT" name-in-module="SYMCNT" offset="0x00" address-space="data" caption="MAC Symbol Counter"/>
                </instance>
            </module>
            <module name="EEPROM">
                <instance name="EEPROM" caption="EEPROM">
                    <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
                </instance>
            </module>
