bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
            <value-group caption="" name="ENUM_BOOTSZ">
                <value caption="Boot Flash size=512 words start address=$7E00" name="512W_7E00" value="0x03"/>
                <value caption="Boot Flash size=1024 words start address=$7C00" name="1024W_7C00" value="0x02"/>
                <value caption="Boot Flash size=2048 words start address=$7800" name="2048W_7800" value="0x01"/>
                <value caption="Boot Flash size=4096 words start address=$7000" name="4096W_7000" value="0x00"/>
            </value-group>
            <value-group caption="" name="ENUM_BODLEVEL">
                <value caption="Brown-out detection disabled" name="DISABLED" value="0x07"/>
                <value caption="Brown-out detection at VCC=1.8 V" name="1V8" value="0x06"/>
                <value caption="Brown-out detection at VCC=1.9 V" name="1V9" value="0x05"/>
                <value caption="Brown-out detection at VCC=2.0 V" name="2V0" value="0x04"/>
                <value caption="Brown-out detection at VCC=2.1 V" name="2V1" value="0x03"/>
                <value caption="Brown-out detection at VCC=2.2 V" name="2V2" value="0x02"/>
                <value caption="Brown-out detection at VCC=2.3 V" name="2V3" value="0x01"/>
                <value caption="Brown-out detection at VCC=2.4 V" name="2V4" value="0x00"/>
            </value-group>
        </module>
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB">
                <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB2">
                <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
                </register>
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="USART" name="USART">
            <register-group caption="USART" name="USART0">
                <register caption="USART0 I/O Data Register" name="UDR0" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART0 Control and Status Register A" name="UCSR0A" offset="0xC0" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
                    <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC0"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
                    <bitfield caption="Frame Error" mask="0x10" name="FE0"/>
                    <bitfield caption="Data OverRun" mask="0x08" name="DOR0"/>
                    <bitfield caption="USART Parity Error" mask="0x04" name="UPE0"/>
                    <bitfield caption="Double the USART Transmission Speed" mask="0x02" name="U2X0"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM0"/>
                </register>
                <register caption="USART0 Control and Status Register B" name="UCSR0B" offset="0xC1" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
                    <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ02"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB80"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB80"/>
                </register>
                <register caption="USART0 Control and Status Register C" name="UCSR0C" offset="0xC2" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL0" values="COMM_USART_MODE_2BIT_MEGARF"/>
                    <bitfield caption="Parity Mode" mask="0x30" name="UPM0" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS0" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ0" values="USART_CHAR_SIZE_BITF"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0" values="USART_CLK_POLARITY_BITF"/>
                </register>
