bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
                <register caption="USART0 Baud Rate Register Bytes" name="UBRR0" offset="0xC4" size="2" mask="0xFFFF"/>
            </register-group>
            <register-group caption="USART" name="USART1">
                <register caption="USART1 I/O Data Register" name="UDR1" offset="0xCE" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART1 Control and Status Register A" name="UCSR1A" offset="0xC8" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC1"/>
                    <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC1"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE1"/>
                    <bitfield caption="Frame Error" mask="0x10" name="FE1"/>
                    <bitfield caption="Data OverRun" mask="0x08" name="DOR1"/>
                    <bitfield caption="USART Parity Error" mask="0x04" name="UPE1"/>
                    <bitfield caption="Double the USART Transmission Speed" mask="0x02" name="U2X1"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM1"/>
                </register>
                <register caption="USART1 Control and Status Register B" name="UCSR1B" offset="0xC9" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE1"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE1"/>
                    <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE1"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN1"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN1"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ12"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB81"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB81"/>
                </register>
                <register caption="USART1 Control and Status Register C" name="UCSR1C" offset="0xCA" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL1" values="COMM_USART_MODE_2BIT_MEGARF"/>
                    <bitfield caption="Parity Mode" mask="0x30" name="UPM1" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS1" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ1" values="USART_CHAR_SIZE_BITF"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1" values="USART_CLK_POLARITY_BITF"/>
                </register>
                <register caption="USART1 Baud Rate Register Bytes" name="UBRR1" offset="0xCC" size="2" mask="0xFFFF"/>
            </register-group>
            <value-group caption="" name="COMM_USART_MODE_2BIT_MEGARF">
                <value caption="Asynchronous USART" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous USART" name="VAL_0x01" value="0x01"/>
                <value caption="Reserved" name="VAL_0x02" value="0x02"/>
                <value caption="Master SPI (MSPIM)" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
            <value-group caption="" name="USART_CHAR_SIZE_BITF">
                <value caption="5-bit" name="VAL_0" value="0"/>
                <value caption="6-bit" name="VAL_1" value="1"/>
                <value caption="7-bit" name="VAL_2" value="2"/>
                <value caption="8-bit" name="VAL_3" value="3"/>
                <value caption="Reserved" name="VAL_4" value="4"/>
                <value caption="Reserved" name="VAL_5" value="5"/>
                <value caption="Reserved" name="VAL_6" value="6"/>
                <value caption="9-bit" name="VAL_7" value="7"/>
            </value-group>
            <value-group caption="" name="USART_CLK_POLARITY_BITF">
                <value caption="Rising XCKn Edge (Transmitted Data Changed), Falling XCKn Edge (Received Data Sampled)" name="VAL_0" value="0"/>
                <value caption="Falling XCKn Edge (Transmitted Data Changed), Rising XCKn Edge (Received Data Sampled)" name="VAL_1" value="1"/>
            </value-group>
        </module>
        <module caption="Two Wire Serial Interface" name="TWI">
            <register-group caption="Two Wire Serial Interface" name="TWI">
                <register caption="TWI (Slave) Address Mask Register" name="TWAMR" offset="0xBD" size="1">
                    <bitfield caption="TWI Address Mask" mask="0xFE" name="TWAM"/>
                    <bitfield caption="Reserved Bit" mask="0x01" name="Res"/>
                </register>
                <register caption="TWI Bit Rate Register" name="TWBR" offset="0xB8" size="1" mask="0xFF"/>
                <register caption="TWI Control Register" name="TWCR" offset="0xBC" size="1" ocd-rw="R">
                    <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
                    <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
                    <bitfield caption="TWI START Condition Bit" mask="0x20" name="TWSTA"/>
                    <bitfield caption="TWI STOP Condition Bit" mask="0x10" name="TWSTO"/>
                    <bitfield caption="TWI Write Collision Flag" mask="0x08" name="TWWC"/>
                    <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
                    <bitfield caption="Reserved Bit" mask="0x02" name="Res"/>
                    <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
                </register>
                <register caption="TWI Status Register" name="TWSR" offset="0xB9" size="1">
                    <bitfield caption="TWI Status" mask="0xF8" name="TWS" values="TWI_STATUS_BITF" lsb="3"/>
                    <bitfield caption="Reserved Bit" mask="0x04" name="Res"/>
                    <bitfield caption="TWI Prescaler Bits" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
                </register>
                <register caption="TWI Data Register" name="TWDR" offset="0xBB" size="1" mask="0xFF"/>
                <register caption="TWI (Slave) Address Register" name="TWAR" offset="0xBA" size="1">
                    <bitfield caption="TWI (Slave) Address" mask="0xFE" name="TWA"/>
                    <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
                </register>
            </register-group>
