bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
            <value-group caption="" name="TWI_STATUS_BITF">
                <value caption="Bus error due to illegal START or STOP condition." name="VAL_0x00" value="0x00"/>
                <value caption="A START condition has been transmitted." name="VAL_0x08" value="0x08"/>
                <value caption="A repeated START condition has been transmitted." name="VAL_0x10" value="0x10"/>
                <value caption="SLA+W has been transmitted; ACK has been received." name="VAL_0x18" value="0x18"/>
                <value caption="SLA+W has been transmitted; NOT ACK has been received." name="VAL_0x20" value="0x20"/>
                <value caption="Data byte has been transmitted; ACK has been received." name="VAL_0x28" value="0x28"/>
                <value caption="Data byte has been transmitted; NOT ACK has been received." name="VAL_0x30" value="0x30"/>
                <value caption="Arbitration lost in SLA+W or data bytes (Transmitter); Arbitration lost in SLA+R or NOT ACK bit (Receiver)." name="VAL_0x38" value="0x38"/>
                <value caption="SLA+R has been transmitted; ACK has been received." name="VAL_0x40" value="0x40"/>
                <value caption="SLA+R has been transmitted; NOT ACK has been received." name="VAL_0x48" value="0x48"/>
                <value caption="Data byte has been received; ACK has been returned." name="VAL_0x50" value="0x50"/>
                <value caption="Data byte has been received; NOT ACK has been returned." name="VAL_0x58" value="0x58"/>
                <value caption="Own SLA+W has been received; ACK has been returned." name="VAL_0x60" value="0x60"/>
                <value caption="Arbitration lost in SLA+R/W as Master; own SLA+W has been received; ACK has been returned." name="VAL_0x68" value="0x68"/>
                <value caption="General call address has been received; ACK has been returned." name="VAL_0x70" value="0x70"/>
                <value caption="Arbitration lost in SLA+R/W as Master; general call address has been received; ACK has been returned." name="VAL_0x78" value="0x78"/>
                <value caption="Previously addressed with own SLA+W; data has been received; ACK has been returned." name="VAL_0x80" value="0x80"/>
                <value caption="Previously addressed with own SLA+W; data has been received; NOT ACK has been returned." name="VAL_0x88" value="0x88"/>
                <value caption="Previously addressed with general call; data has been received; ACK has been returned." name="VAL_0x90" value="0x90"/>
                <value caption="Previously addressed with general call; data has been received; NOT ACK has been returned." name="VAL_0x98" value="0x98"/>
                <value caption="A STOP condition or repeated START condition has been received while still addressed as Slave." name="VAL_0xA0" value="0xA0"/>
                <value caption="Own SLA+R has been received; ACK has been returned." name="VAL_0xA8" value="0xA8"/>
                <value caption="Arbitration lost in SLA+R/W as Master; own SLA+R has been received; ACK has been returned." name="VAL_0xB0" value="0xB0"/>
                <value caption="Data byte in TWDR has been transmitted; ACK has been received." name="VAL_0xB8" value="0xB8"/>
                <value caption="Data byte in TWDR has been transmitted; NO ACK has been received." name="VAL_0xC0" value="0xC0"/>
                <value caption="Last data byte in TWDR has been transmitted (TWEA = 0); ACK has been received." name="VAL_0xC8" value="0xC8"/>
                <value caption="No relevant state information available; TWINT = 0." name="VAL_0xF8" value="0xF8"/>
            </value-group>
            <value-group caption="" name="COMM_TWI_PRESACLE">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="4" name="VAL_0x01" value="0x01"/>
                <value caption="16" name="VAL_0x02" value="0x02"/>
                <value caption="64" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Serial Peripheral Interface" name="SPI">
            <register-group caption="Serial Peripheral Interface" name="SPI">
                <register caption="SPI Control Register" name="SPCR" offset="0x4C" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL" values="SPI_CPOL_BITF"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA" values="SPI_CPHA_BITF"/>
                    <bitfield caption="SPI Clock Rate Select 1 and 0" mask="0x03" name="SPR" values="COMM_SCK_RATE_SPI2X"/>
                </register>
                <register caption="SPI Status Register" name="SPSR" offset="0x4D" size="1" ocd-rw="R">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
                </register>
                <register caption="SPI Data Register" name="SPDR" offset="0x4E" size="1" mask="0xFF" ocd-rw=""/>
            </register-group>
            <register-group caption="Serial Peripheral Interface" name="USART0_SPI">
                <register caption="USART0 MSPIM Control and Status Register A" name="UCSR0A" offset="0xC0" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
                    <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC0"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
                </register>
                <register caption="USART0 MSPIM Control and Status Register B" name="UCSR0B" offset="0xC1" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
                    <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
                </register>
