bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
                <register caption="USART0 MSPIM Control and Status Register C" name="UCSR0C" offset="0xC2" size="1">
                    <bitfield caption="Data Order" mask="0x04" name="UDORD0"/>
                    <bitfield caption="Clock Phase" mask="0x02" name="UCPHA0"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0"/>
                </register>
            </register-group>
            <register-group caption="Serial Peripheral Interface" name="USART1_SPI">
                <register caption="USART1 MSPIM Control and Status Register A" name="UCSR1A" offset="0xC8" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC1"/>
                    <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC1"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE1"/>
                </register>
                <register caption="USART1 MSPIM Control and Status Register B" name="UCSR1B" offset="0xC9" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE1"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE1"/>
                    <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE1"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN1"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN1"/>
                </register>
                <register caption="USART1 MSPIM Control and Status Register C" name="UCSR1C" offset="0xCA" size="1">
                    <bitfield caption="Data Order" mask="0x04" name="UDORD1"/>
                    <bitfield caption="Clock Phase" mask="0x02" name="UCPHA1"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1"/>
                </register>
            </register-group>
            <value-group caption="" name="SPI_CPOL_BITF">
                <value caption="Rising (Leading Edge), Falling (Trailing Edge)" name="VAL_0" value="0"/>
                <value caption="Falling (Leading Egde), Rising (Trailing Edge)" name="VAL_1" value="1"/>
            </value-group>
            <value-group caption="" name="SPI_CPHA_BITF">
                <value caption="Sample (Leading Edge), Setup (Trailing Edge)" name="VAL_0" value="0"/>
                <value caption="Setup (Leading Edge), Sample (Trailing Edge)" name="VAL_1" value="1"/>
            </value-group>
            <value-group caption="" name="COMM_SCK_RATE_SPI2X">
                <value caption="fosc/4 / fosc/2 (SPI2X=0/1)" name="VAL_0x00" value="0x00"/>
                <value caption="fosc/16 / fosc/8 (SPI2X=0/1)" name="VAL_0x01" value="0x01"/>
                <value caption="fosc/64 / fosc/32 (SPI2X=0/1)" name="VAL_0x02" value="0x02"/>
                <value caption="fosc/128 / fosc/64 (SPI2X=0/1)" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port A Data Register" name="PORTA" offset="0x22" size="1" mask="0xFF"/>
                <register caption="Port A Data Direction Register" name="DDRA" offset="0x21" size="1" mask="0xFF"/>
                <register caption="Port A Input Pins Address" name="PINA" offset="0x20" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTB">
                <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
                <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
                <register caption="Port B Input Pins Address" name="PINB" offset="0x23" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTC">
                <register caption="Port C Data Register" name="PORTC" offset="0x28" size="1" mask="0xFF"/>
                <register caption="Port C Data Direction Register" name="DDRC" offset="0x27" size="1" mask="0xFF"/>
                <register caption="Port C Input Pins Address" name="PINC" offset="0x26" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTD">
                <register caption="Port D Data Register" name="PORTD" offset="0x2B" size="1" mask="0xFF"/>
                <register caption="Port D Data Direction Register" name="DDRD" offset="0x2A" size="1" mask="0xFF"/>
                <register caption="Port D Input Pins Address" name="PIND" offset="0x29" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTE">
                <register caption="Port E Data Register" name="PORTE" offset="0x2E" size="1" mask="0xFF"/>
                <register caption="Port E Data Direction Register" name="DDRE" offset="0x2D" size="1" mask="0xFF"/>
                <register caption="Port E Input Pins Address" name="PINE" offset="0x2C" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTF">
                <register caption="Port F Data Register" name="PORTF" offset="0x31" size="1" mask="0xFF"/>
                <register caption="Port F Data Direction Register" name="DDRF" offset="0x30" size="1" mask="0xFF"/>
                <register caption="Port F Input Pins Address" name="PINF" offset="0x2F" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTG">
                <register caption="Port G Data Register" name="PORTG" offset="0x34" size="1" mask="0xFF"/>
                <register caption="Port G Data Direction Register" name="DDRG" offset="0x33" size="1" mask="0xFF"/>
                <register caption="Port G Input Pins Address" name="PING" offset="0x32" size="1" mask="0xFF"/>
            </register-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter0 Output Compare Register B" name="OCR0B" offset="0x48" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x47" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Register" name="TCNT0" offset="0x46" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Control Register B" name="TCCR0B" offset="0x45" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
                    <bitfield caption="Reserved Bit" mask="0x30" name="Res"/>
                    <bitfield caption="" mask="0x08" name="WGM02"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="TC0_CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter0 Control Register A" name="TCCR0A" offset="0x44" size="1">
                    <bitfield caption="Compare Match Output A Mode" mask="0xC0" name="COM0A" values="TC0_COM0A_BITF"/>
                    <bitfield caption="Compare Match Output B Mode" mask="0x30" name="COM0B" values="TC0_COM0B_BITF"/>
                    <bitfield caption="Reserved Bit" mask="0x0C" name="Res"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0" values="TC0_WGM_BITF"/>
                </register>
