bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
                <register caption="Timer/Counter0 Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x04" name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02" name="OCIE0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Flag Register" name="TIFR0" offset="0x35" size="1" ocd-rw="R">
                    <bitfield caption="Timer/Counter0 Output Compare B Match Flag" mask="0x04" name="OCF0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare A Match Flag" mask="0x02" name="OCF0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
                </register>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter2" mask="0x02" name="PSRASY"/>
                    <bitfield caption="Prescaler Reset for Synchronous Timer/Counters" mask="0x01" name="PSRSYNC"/>
                </register>
            </register-group>
            <value-group caption="" name="TC0_CLK_SEL_3BIT_EXT">
                <value caption="No clock source (Timer/Counter0 stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="clk_IO/1 (no prescaling)" name="VAL_0x01" value="0x01"/>
                <value caption="clk_IO/8 (from prescaler)" name="VAL_0x02" value="0x02"/>
                <value caption="clk_IO/64 (from prescaler)" name="VAL_0x03" value="0x03"/>
                <value caption="clk_IO/256 (from prescaler)" name="VAL_0x04" value="0x04"/>
                <value caption="clk_IO/1024 (from prescaler)" name="VAL_0x05" value="0x05"/>
                <value caption="External clock source on T0 pin, clock on falling edge" name="VAL_0x06" value="0x06"/>
                <value caption="External clock source on T0 pin, clock on rising edge" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="TC0_COM0A_BITF">
                <value caption="Normal port operation, OC0A disconnected" name="VAL_0" value="0"/>
                <value caption="Toggle OC0A on Compare Match" name="VAL_1" value="1"/>
                <value caption="Clear OC0A on Compare Match" name="VAL_2" value="2"/>
                <value caption="Set OC0A on Compare Match" name="VAL_3" value="3"/>
            </value-group>
            <value-group caption="" name="TC0_COM0B_BITF">
                <value caption="Normal port operation, OC0B disconnected" name="VAL_0" value="0"/>
                <value caption="Toggle OC0B on Compare Match" name="VAL_1" value="1"/>
                <value caption="Clear OC0B on Compare Match" name="VAL_2" value="2"/>
                <value caption="Set OC0B on Compare Match" name="VAL_3" value="3"/>
            </value-group>
            <value-group caption="" name="TC0_WGM_BITF">
                <value caption="Normal mode of operation" name="VAL_0x0" value="0x0"/>
                <value caption="PWM, phase correct, TOP=0xFF" name="VAL_0x1" value="0x1"/>
                <value caption="CTC, TOP = OCRA" name="VAL_0x2" value="0x2"/>
                <value caption="Fast PWM, TOP=0xFF" name="VAL_0x3" value="0x3"/>
                <value caption="Reserved" name="VAL_0x4" value="0x4"/>
                <value caption="PWM, Phase correct, TOP = OCRA" name="VAL_0x5" value="0x5"/>
                <value caption="Reserved" name="VAL_0x6" value="0x6"/>
                <value caption="Fast PWM, TOP=OCRA" name="VAL_0x7" value="0x7"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
            <register-group caption="Timer/Counter, 8-bit Async" name="TC2">
                <register caption="Timer/Counter Interrupt Mask register" name="TIMSK2" offset="0x70" size="1">
                    <bitfield caption="Reserved Bit" mask="0xF8" name="Res"/>
                    <bitfield caption="Timer/Counter2 Output Compare Match B Interrupt Enable" mask="0x04" name="OCIE2B"/>
                    <bitfield caption="Timer/Counter2 Output Compare Match A Interrupt Enable" mask="0x02" name="OCIE2A"/>
                    <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x01" name="TOIE2"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag Register" name="TIFR2" offset="0x37" size="1" ocd-rw="R">
                    <bitfield caption="Reserved Bit" mask="0xF8" name="Res"/>
                    <bitfield caption="Output Compare Flag 2 B" mask="0x04" name="OCF2B"/>
                    <bitfield caption="Output Compare Flag 2 A" mask="0x02" name="OCF2A"/>
                    <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x01" name="TOV2"/>
                </register>
                <register caption="Timer/Counter2 Control Register A" name="TCCR2A" offset="0xB0" size="1">
                    <bitfield caption="Compare Match Output A Mode" mask="0xC0" name="COM2A" values="TC2_COM2A_BITF"/>
                    <bitfield caption="Compare Match Output B Mode" mask="0x30" name="COM2B" values="TC2_COM2B_BITF"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM2" values="TC0_WGM_BITF"/>
                </register>
                <register caption="Timer/Counter2 Control Register B" name="TCCR2B" offset="0xB1" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC2A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC2B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM22"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS2" values="TC2_CLK_SEL_3BIT"/>
                </register>
                <register caption="Timer/Counter2" name="TCNT2" offset="0xB2" size="1" mask="0xFF"/>
