bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
                <register caption="Timer/Counter3 Output Compare Register B Bytes" name="OCR3B" offset="0x9A" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register C Bytes" name="OCR3C" offset="0x9C" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Input Capture Register Bytes" name="ICR3" offset="0x96" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Interrupt Mask Register" name="TIMSK3" offset="0x71" size="1">
                    <bitfield caption="Timer/Counter3 Input Capture Interrupt Enable" mask="0x20" name="ICIE3"/>
                    <bitfield caption="Timer/Counter3 Output Compare C Match Interrupt Enable" mask="0x08" name="OCIE3C"/>
                    <bitfield caption="Timer/Counter3 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE3B"/>
                    <bitfield caption="Timer/Counter3 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE3A"/>
                    <bitfield caption="Timer/Counter3 Overflow Interrupt Enable" mask="0x01" name="TOIE3"/>
                </register>
                <register caption="Timer/Counter3 Interrupt Flag Register" name="TIFR3" offset="0x38" size="1" ocd-rw="R">
                    <bitfield caption="Timer/Counter3 Input Capture Flag" mask="0x20" name="ICF3"/>
                    <bitfield caption="Timer/Counter3 Output Compare C Match Flag" mask="0x08" name="OCF3C"/>
                    <bitfield caption="Timer/Counter3 Output Compare B Match Flag" mask="0x04" name="OCF3B"/>
                    <bitfield caption="Timer/Counter3 Output Compare A Match Flag" mask="0x02" name="OCF3A"/>
                    <bitfield caption="Timer/Counter3 Overflow Flag" mask="0x01" name="TOV3"/>
                </register>
            </register-group>
            <register-group caption="Timer/Counter, 16-bit" name="TC1">
                <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x80" size="1">
                    <bitfield caption="Compare Output Mode for Channel A" mask="0xC0" name="COM1A" values="TC1_COMNX_BITF"/>
                    <bitfield caption="Compare Output Mode for Channel B" mask="0x30" name="COM1B" values="TC1_COMNX_BITF"/>
                    <bitfield caption="Compare Output Mode for Channel C" mask="0x0C" name="COM1C" values="TC1_COMNX_BITF"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1" values="TC1_WGMX_BITF"/>
                </register>
                <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
                    <bitfield caption="Input Capture 1 Noise Canceller" mask="0x80" name="ICNC1"/>
                    <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
                    <bitfield caption="Reserved Bit" mask="0x20" name="Res"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" values="TC1_WGMX_BITF" lsb="2"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT_MEGARF"/>
                </register>
                <register caption="Timer/Counter1 Control Register C" name="TCCR1C" offset="0x82" size="1">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC1A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC1B"/>
                    <bitfield caption="Force Output Compare for Channel C" mask="0x20" name="FOC1C"/>
                </register>
                <register caption="Timer/Counter1 Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register A Bytes" name="OCR1A" offset="0x88" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register B Bytes" name="OCR1B" offset="0x8A" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register C Bytes" name="OCR1C" offset="0x8C" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Input Capture Register Bytes" name="ICR1" offset="0x86" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
                    <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
                    <bitfield caption="Timer/Counter1 Output Compare C Match Interrupt Enable" mask="0x08" name="OCIE1C"/>
                    <bitfield caption="Timer/Counter1 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
                </register>
                <register caption="Timer/Counter1 Interrupt Flag Register" name="TIFR1" offset="0x36" size="1" ocd-rw="R">
                    <bitfield caption="Timer/Counter1 Input Capture Flag" mask="0x20" name="ICF1"/>
                    <bitfield caption="Timer/Counter1 Output Compare C Match Flag" mask="0x08" name="OCF1C"/>
                    <bitfield caption="Timer/Counter1 Output Compare B Match Flag" mask="0x04" name="OCF1B"/>
                    <bitfield caption="Timer/Counter1 Output Compare A Match Flag" mask="0x02" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
                </register>
            </register-group>
            <value-group caption="" name="TC4_COMNX_BITF">
                <value caption="Normal operation" name="VAL_0" value="0"/>
                <value caption="Reserved" name="VAL_1" value="1"/>
                <value caption="Reserved" name="VAL_2" value="2"/>
                <value caption="Reserved" name="VAL_3" value="3"/>
            </value-group>
            <value-group caption="" name="TC1_WGMX_BITF">
                <value caption="Normal mode of operation" name="VAL_0x0" value="0x0"/>
                <value caption="PWM, phase correct, 8-bit" name="VAL_0x1" value="0x1"/>
                <value caption="PWM, phase correct, 9-bit" name="VAL_0x2" value="0x2"/>
                <value caption="PWM, phase correct, 10-bit" name="VAL_0x3" value="0x3"/>
                <value caption="CTC, TOP = OCRnA" name="VAL_0x4" value="0x4"/>
                <value caption="Fast PWM, 8-bit" name="VAL_0x5" value="0x5"/>
                <value caption="Fast PWM, 9-bit" name="VAL_0x6" value="0x6"/>
                <value caption="Fast PWM, 10-bit" name="VAL_0x7" value="0x7"/>
                <value caption="PWM, Phase and frequency correct, TOP = ICRn" name="VAL_0x8" value="0x8"/>
                <value caption="PWM, Phase and frequency correct, TOP = OCRnA" name="VAL_0x9" value="0x9"/>
                <value caption="PWM, Phase correct, TOP = ICRn" name="VAL_0xA" value="0xA"/>
                <value caption="PWM, Phase correct, TOP = OCRnA" name="VAL_0xB" value="0xB"/>
                <value caption="CTC, TOP = OCRnA" name="VAL_0xC" value="0xC"/>
                <value caption="Reserved" name="VAL_0xD" value="0xD"/>
                <value caption="Fast PWM, TOP = ICRn" name="VAL_0xE" value="0xE"/>
                <value caption="Fast PWM, TOP = OCRnA" name="VAL_0xF" value="0xF"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_3BIT_NOEXT_MEGARF">
                <value caption="No clock source (Timer/Counter stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="clk_IO/1 (no prescaling)" name="VAL_0x01" value="0x01"/>
                <value caption="clk_IO/8 (from prescaler)" name="VAL_0x02" value="0x02"/>
                <value caption="clk_IO/64 (from prescaler)" name="VAL_0x03" value="0x03"/>
                <value caption="clk_IO/256 (from prescaler)" name="VAL_0x04" value="0x04"/>
                <value caption="clk_IO/1024 (from prescaler)" name="VAL_0x05" value="0x05"/>
                <value caption="Reserved" name="VAL_0x06" value="0x06"/>
                <value caption="Reserved" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="TC1_COMNX_BITF">
                <value caption="Normal port operation, OCnA/OCnB/OCnC disconnected." name="VAL_0" value="0"/>
                <value caption="Toggle OCnA/OCnB/OCnC on Compare Match." name="VAL_1" value="1"/>
                <value caption="Clear OCnA/OCnB/OCnC on Compare Match (set output to low level)." name="VAL_2" value="2"/>
                <value caption="Set OCnA/OCnB/OCnC on Compare Match (set output to high level)." name="VAL_3" value="3"/>
            </value-group>
