bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
            <value-group caption="" name="CLK_SEL_3BIT_EXT_MEGARF">
                <value caption="No clock source (Timer/Counter stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="clk_IO/1 (no prescaling)" name="VAL_0x01" value="0x01"/>
                <value caption="clk_IO/8 (from prescaler)" name="VAL_0x02" value="0x02"/>
                <value caption="clk_IO/64 (from prescaler)" name="VAL_0x03" value="0x03"/>
                <value caption="clk_IO/256 (from prescaler)" name="VAL_0x04" value="0x04"/>
                <value caption="clk_IO/1024 (from prescaler)" name="VAL_0x05" value="0x05"/>
                <value caption="External clock source on Tn pin, clock on falling edge" name="VAL_0x06" value="0x06"/>
                <value caption="External clock source on Tn pin, clock on rising edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Low-Power 2.4 GHz Transceiver" name="TRX24">
            <register-group caption="Low-Power 2.4 GHz Transceiver" name="TRX24">
                <register caption="Power Amplifier Ramp up/down Control Register" name="PARCR" offset="0x138" size="1">
                    <bitfield caption="ext. PA Ramp Down Lead Time" mask="0xE0" name="PALTD" values="PALTD_bitf"/>
                    <bitfield caption="ext. PA Ramp Up Lead Time" mask="0x1C" name="PALTU" values="PALTU_bitf"/>
                    <bitfield caption="Power Amplifier Ramp Down Frequency Inversion" mask="0x02" name="PARDFI"/>
                    <bitfield caption="Power Amplifier Ramp Up Frequency Inversion" mask="0x01" name="PARUFI"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 0 (Low Byte)" name="MAFSA0L" offset="0x10E" size="1">
                    <bitfield caption="MAC Short Address low Byte for Frame Filter 0" mask="0xFF" name="MAFSA0L"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 0 (High Byte)" name="MAFSA0H" offset="0x10F" size="1">
                    <bitfield caption="MAC Short Address high Byte for Frame Filter 0" mask="0xFF" name="MAFSA0H"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 0 (Low Byte)" name="MAFPA0L" offset="0x110" size="1">
                    <bitfield caption="MAC Personal Area Network ID low Byte for Frame Filter 0" mask="0xFF" name="MAFPA0L"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 0 (High Byte)" name="MAFPA0H" offset="0x111" size="1">
                    <bitfield caption="MAC Personal Area Network ID high Byte for Frame Filter 0" mask="0xFF" name="MAFPA0H"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 1 (Low Byte)" name="MAFSA1L" offset="0x112" size="1">
                    <bitfield caption="MAC Short Address low Byte for Frame Filter 1" mask="0xFF" name="MAFSA1L"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 1 (High Byte)" name="MAFSA1H" offset="0x113" size="1">
                    <bitfield caption="MAC Short Address high Byte for Frame Filter 1" mask="0xFF" name="MAFSA1H"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 1 (Low Byte)" name="MAFPA1L" offset="0x114" size="1">
                    <bitfield caption="MAC Personal Area Network ID low Byte for Frame Filter 1" mask="0xFF" name="MAFPA1L"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 1 (High Byte)" name="MAFPA1H" offset="0x115" size="1">
                    <bitfield caption="MAC Personal Area Network ID high Byte for Frame Filter 1" mask="0xFF" name="MAFPA1H"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 2 (Low Byte)" name="MAFSA2L" offset="0x116" size="1">
                    <bitfield caption="MAC Short Address low Byte for Frame Filter 2" mask="0xFF" name="MAFSA2L"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 2 (High Byte)" name="MAFSA2H" offset="0x117" size="1">
                    <bitfield caption="MAC Short Address high Byte for Frame Filter 2" mask="0xFF" name="MAFSA2H"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 2 (Low Byte)" name="MAFPA2L" offset="0x118" size="1">
                    <bitfield caption="MAC Personal Area Network ID low Byte for Frame Filter 2" mask="0xFF" name="MAFPA2L"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 2 (High Byte)" name="MAFPA2H" offset="0x119" size="1">
                    <bitfield caption="MAC Personal Area Network ID high Byte for Frame Filter 2" mask="0xFF" name="MAFPA2H"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 3 (Low Byte)" name="MAFSA3L" offset="0x11A" size="1">
                    <bitfield caption="MAC Short Address low Byte for Frame Filter 3" mask="0xFF" name="MAFSA3L"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 3 (High Byte)" name="MAFSA3H" offset="0x11B" size="1">
                    <bitfield caption="MAC Short Address high Byte for Frame Filter 3" mask="0xFF" name="MAFSA3H"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 3 (Low Byte)" name="MAFPA3L" offset="0x11C" size="1">
                    <bitfield caption="MAC Personal Area Network ID low Byte for Frame Filter 3" mask="0xFF" name="MAFPA3L"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 3 (High Byte)" name="MAFPA3H" offset="0x11D" size="1">
                    <bitfield caption="MAC Personal Area Network ID high Byte for Frame Filter 3" mask="0xFF" name="MAFPA3H"/>
                </register>
                <register caption="Multiple Address Filter Configuration Register 0" name="MAFCR0" offset="0x10C" size="1">
                    <bitfield caption="Reserved Bit" mask="0xF0" name="Res"/>
                    <bitfield caption="Multiple Address Filter 3 Enable" mask="0x08" name="MAF3EN"/>
                    <bitfield caption="Multiple Address Filter 2 Enable" mask="0x04" name="MAF2EN"/>
                    <bitfield caption="Multiple Address Filter 1 Enable" mask="0x02" name="MAF1EN"/>
                    <bitfield caption="Multiple Address Filter 0 Enable" mask="0x01" name="MAF0EN"/>
                </register>
