bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
            <value-group caption="" name="RSSI_VALUE_BITF">
                <value caption="Minimum RSSI value: P(RF) &lt; -90 dBm" name="RSSI_MIN" value="0"/>
                <value caption="P(RF) = RSSI_BASE_VAL+3 · (RSSI-1) [dBm]" name="RSSI_MIN_PLUS_3dB" value="1"/>
                <value caption="..." name="VAL_2" value="2"/>
                <value caption="Maximum RSSI value: P(RF) ≥ -10 dBm" name="RSSI_MAX" value="28"/>
            </value-group>
            <value-group caption="" name="ED_LEVEL_BITF">
                <value caption="Minimum result of last ED measurement" name="ED_MIN" value="0x00"/>
                <value caption="P(RF) = RSSI_BASE_VAL+ED [dBm]" name="ED_MIN_PLUS_1dB" value="0x01"/>
                <value caption="..." name="VAL_0x02" value="0x02"/>
                <value caption="Maximum result of last ED measurement" name="ED_MAX" value="0x54"/>
                <value caption="Reset value" name="ED_RESET" value="0xFF"/>
            </value-group>
            <value-group caption="" name="CCA_MODE_bitf">
                <value caption="Mode 3a, Carrier sense OR energy above threshold" name="CCA_CS_OR_ED" value="0"/>
                <value caption="Mode 1, Energy above threshold" name="CCA_ED" value="1"/>
                <value caption="Mode 2, Carrier sense only" name="CCA_CS" value="2"/>
                <value caption="Mode 3b, Carrier sense AND energy above threshold" name="CCA_CS_AND_ED" value="3"/>
            </value-group>
            <value-group caption="" name="CHANNEL_bitf">
                <value caption="2405 MHz" name="F_2405MHZ" value="11"/>
                <value caption="2410 MHz" name="F_2410MHZ" value="12"/>
                <value caption="2415 MHz" name="F_2415MHZ" value="13"/>
                <value caption="2420 MHz" name="F_2420MHZ" value="14"/>
                <value caption="2425 MHz" name="F_2425MHZ" value="15"/>
                <value caption="2430 MHz" name="F_2430MHZ" value="16"/>
                <value caption="2435 MHz" name="F_2435MHZ" value="17"/>
                <value caption="2440 MHz" name="F_2440MHZ" value="18"/>
                <value caption="2445 MHz" name="F_2445MHZ" value="19"/>
                <value caption="2450 MHz" name="F_2450MHZ" value="20"/>
                <value caption="2455 MHz" name="F_2455MHZ" value="21"/>
                <value caption="2460 MHz" name="F_2460MHZ" value="22"/>
                <value caption="2465 MHz" name="F_2465MHZ" value="23"/>
                <value caption="2470 MHz" name="F_2470MHZ" value="24"/>
                <value caption="2475 MHz" name="F_2475MHZ" value="25"/>
                <value caption="2480 MHz" name="F_2480MHZ" value="26"/>
            </value-group>
            <value-group caption="" name="PDT_THRES_bitf">
                <value caption="Reset value, to be used if Antenna Diversity algorithm is disabled" name="PDT_THRES_ANT_DIV_OFF" value="0x7"/>
                <value caption="Recommended correlator threshold for Antenna Diversity operation" name="PDT_THRES_ANT_DIV_ON" value="0x3"/>
            </value-group>
            <value-group caption="" name="SFD_VALUE_BITF">
                <value caption="IEEE 802.15.4 compliant value of the SFD" name="IEEE_SFD" value="0xA7"/>
            </value-group>
            <value-group caption="" name="OQPSK_DATA_RATE_bitf">
                <value caption="250 kb/s (IEEE 802.15.4 compliant)" name="RATE_250KB" value="0"/>
                <value caption="500 kb/s" name="RATE_500KB" value="1"/>
                <value caption="1000 kb/s" name="RATE_1000KB" value="2"/>
                <value caption="2000 kb/s" name="RATE_2000KB" value="3"/>
            </value-group>
            <value-group caption="" name="ANT_SEL_bitf">
                <value caption="Antenna 0" name="ANTENNA_0" value="0"/>
                <value caption="Antenna 1" name="ANTENNA_1" value="1"/>
            </value-group>
            <value-group caption="" name="ANT_DIV_EN_bitf">
                <value caption="Antenna Diversity algorithm disabled" name="VAL_0" value="0"/>
                <value caption="Antenna Diversity algorithm enabled" name="VAL_1" value="1"/>
            </value-group>
            <value-group caption="" name="ANT_EXT_SW_EN_bitf">
                <value caption="Antenna Diversity RF switch control disabled" name="ANT_DIV_EXT_SW_DIS" value="0"/>
                <value caption="Antenna Diversity RF switch control enabled" name="ANT_DIV_EXT_SW_EN" value="1"/>
            </value-group>
            <value-group caption="" name="ANT_CTRL_bitf">
                <value caption="Reserved" name="VAL_0" value="0"/>
                <value caption="Antenna 1: DIG1=H, DIG2=L" name="ANT_1" value="1"/>
                <value caption="Antenna 0: DIG1=L, DIG2=H" name="ANT_0" value="2"/>
                <value caption="Default value for ANT_EXT_SW_EN=0; Mandatory setting for applications not using Antenna Diversity" name="ANT_RESET" value="3"/>
            </value-group>
            <value-group caption="" name="AVREG_EXT_BITF">
                <value caption="Internal AVDD voltage regulator for the analog section is enabled." name="AVDD_INT" value="0"/>
                <value caption="Internal AVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the analog section." name="AVDD_EXT" value="1"/>
            </value-group>
            <value-group caption="" name="AVDD_OK_BITF">
                <value caption="Analog voltage regulator disabled or supply voltage not stable" name="VAL_0" value="0"/>
                <value caption="Analog supply voltage has settled" name="VAL_1" value="1"/>
            </value-group>
            <value-group caption="" name="DVREG_EXT_BITF">
                <value caption="Internal DVDD voltage regulator for the digital section is enabled." name="DVDD_INT" value="0"/>
                <value caption="Internal DVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the digital section." name="DVDD_EXT" value="1"/>
            </value-group>
            <value-group caption="" name="DVDD_OK_BITF">
                <value caption="Digital voltage regulator disabled or supply voltage not stable" name="VAL_0" value="0"/>
                <value caption="Digital supply voltage has settled" name="VAL_1" value="1"/>
            </value-group>
            <value-group caption="" name="BATMON_OK_bitf">
                <value caption="The battery voltage is below the threshold." name="VAL_0" value="0"/>
                <value caption="The battery voltage is above the threshold." name="VAL_1" value="1"/>
            </value-group>
            <value-group caption="" name="BATMON_HR_bitf">
                <value caption="Enables the low range, see BATMON_VTH" name="BATMON_HR_DIS" value="0"/>
                <value caption="Enables the high range, see BATMON_VTH" name="BATMON_HR_EN" value="1"/>
            </value-group>
            <value-group caption="" name="BATMON_VTH_bitf">
                <value caption="2.550V / 1.70V (BATMON_HR=1/0)" name="VAL_0x0" value="0x0"/>
                <value caption="2.625V / 1.75V (BATMON_HR=1/0)" name="VAL_0x1" value="0x1"/>
                <value caption="2.700V / 1.80V (BATMON_HR=1/0)" name="VAL_0x2" value="0x2"/>
                <value caption="2.775V / 1.85V (BATMON_HR=1/0)" name="VAL_0x3" value="0x3"/>
                <value caption="2.850V / 1.90V (BATMON_HR=1/0)" name="VAL_0x4" value="0x4"/>
                <value caption="2.925V / 1.95V (BATMON_HR=1/0)" name="VAL_0x5" value="0x5"/>
                <value caption="3.000V / 2.00V (BATMON_HR=1/0)" name="VAL_0x6" value="0x6"/>
                <value caption="3.075V / 2.05V (BATMON_HR=1/0)" name="VAL_0x7" value="0x7"/>
                <value caption="3.150V / 2.10V (BATMON_HR=1/0)" name="VAL_0x8" value="0x8"/>
                <value caption="3.225V / 2.15V (BATMON_HR=1/0)" name="VAL_0x9" value="0x9"/>
                <value caption="3.300V / 2.20V (BATMON_HR=1/0)" name="VAL_0xA" value="0xA"/>
                <value caption="3.375V / 2.25V (BATMON_HR=1/0)" name="VAL_0xB" value="0xB"/>
                <value caption="3.450V / 2.30V (BATMON_HR=1/0)" name="VAL_0xC" value="0xC"/>
                <value caption="3.525V / 2.35V (BATMON_HR=1/0)" name="VAL_0xD" value="0xD"/>
                <value caption="3.600V / 2.40V (BATMON_HR=1/0)" name="VAL_0xE" value="0xE"/>
                <value caption="3.675V / 2.45V (BATMON_HR=1/0)" name="VAL_0xF" value="0xF"/>
            </value-group>
            <value-group caption="" name="XTAL_MODE_BITF">
                <value caption="Internal crystal oscillator disabled; use external reference frequency." name="VAL_0x4" value="0x4"/>
                <value caption="Internal crystal oscillator enabled; amplitude regulation of oscillation enabled." name="VAL_0xF" value="0xF"/>
            </value-group>
            <value-group caption="" name="XTAL_TRIM_bitf">
                <value caption="0.0 pF, trimming capacitors disconnected" name="XTAL_TRIM_MIN" value="0x0"/>
                <value caption="0.3 pF, trimming capacitor switched on" name="VAL_0x1" value="0x1"/>
                <value caption="..." name="VAL_0x2" value="0x2"/>
                <value caption="4.5 pF, trimming capacitor switched on" name="XTAL_TRIM_MAX" value="0xF"/>
            </value-group>
            <value-group caption="" name="RX_PDT_LEVEL_BITF">
                <value caption="RX_THRES ≤ RSSI_BASE_VAL (Reset value); RSSI value not considered" name="RX_PDT_LEVEL_MIN" value="0x0"/>
                <value caption="RX_THRES &gt; RSSI_BASE_VAL + 0 · 3; RSSI &gt; -90 dBm" name="VAL_0x1" value="0x1"/>
                <value caption="..." name="VAL_0x2" value="0x2"/>
                <value caption="RX_THRES &gt; RSSI_BASE_VAL + 13 · 3; RSSI &gt; -51 dBm" name="VAL_0xE" value="0xE"/>
                <value caption="RX_THRES &gt; RSSI_BASE_VAL + 14 · 3; RSSI &gt; -48 dBm" name="RX_PDT_LEVEL_MAX" value="0xF"/>
            </value-group>
