bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
                <register caption="Symbol Counter Output Compare Register 1 HL-Byte" name="SCOCR1HL" offset="0xF7" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 1 HL-Byte" mask="0xFF" name="SCOCR1HL"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 1 LH-Byte" name="SCOCR1LH" offset="0xF6" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 1 LH-Byte" mask="0xFF" name="SCOCR1LH"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 1 LL-Byte" name="SCOCR1LL" offset="0xF5" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 1 LL-Byte" mask="0xFF" name="SCOCR1LL"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 2 HH-Byte" name="SCOCR2HH" offset="0xF4" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 2 HH-Byte" mask="0xFF" name="SCOCR2HH"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 2 HL-Byte" name="SCOCR2HL" offset="0xF3" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 2 HL-Byte" mask="0xFF" name="SCOCR2HL"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 2 LH-Byte" name="SCOCR2LH" offset="0xF2" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 2 LH-Byte" mask="0xFF" name="SCOCR2LH"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 2 LL-Byte" name="SCOCR2LL" offset="0xF1" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 2 LL-Byte" mask="0xFF" name="SCOCR2LL"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 3 HH-Byte" name="SCOCR3HH" offset="0xF0" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 3 HH-Byte" mask="0xFF" name="SCOCR3HH"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 3 HL-Byte" name="SCOCR3HL" offset="0xEF" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 3 HL-Byte" mask="0xFF" name="SCOCR3HL"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 3 LH-Byte" name="SCOCR3LH" offset="0xEE" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 3 LH-Byte" mask="0xFF" name="SCOCR3LH"/>
                </register>
                <register caption="Symbol Counter Output Compare Register 3 LL-Byte" name="SCOCR3LL" offset="0xED" size="1">
                    <bitfield caption="Symbol Counter Output Compare Register 3 LL-Byte" mask="0xFF" name="SCOCR3LL"/>
                </register>
                <register caption="Symbol Counter Frame Timestamp Register HH-Byte" name="SCTSRHH" offset="0xEC" size="1" ocd-rw="R">
                    <bitfield caption="Symbol Counter Frame Timestamp Register HH-Byte" mask="0xFF" name="SCTSRHH"/>
                </register>
                <register caption="Symbol Counter Frame Timestamp Register HL-Byte" name="SCTSRHL" offset="0xEB" size="1" ocd-rw="R">
                    <bitfield caption="Symbol Counter Frame Timestamp Register HL-Byte" mask="0xFF" name="SCTSRHL"/>
                </register>
                <register caption="Symbol Counter Frame Timestamp Register LH-Byte" name="SCTSRLH" offset="0xEA" size="1" ocd-rw="R">
                    <bitfield caption="Symbol Counter Frame Timestamp Register LH-Byte" mask="0xFF" name="SCTSRLH"/>
                </register>
                <register caption="Symbol Counter Frame Timestamp Register LL-Byte" name="SCTSRLL" offset="0xE9" size="1" ocd-rw="R">
                    <bitfield caption="Symbol Counter Frame Timestamp Register LL-Byte" mask="0xFF" name="SCTSRLL"/>
                </register>
                <register caption="Symbol Counter Beacon Timestamp Register HH-Byte" name="SCBTSRHH" offset="0xE8" size="1">
                    <bitfield caption="Symbol Counter Beacon Timestamp Register HH-Byte" mask="0xFF" name="SCBTSRHH"/>
                </register>
                <register caption="Symbol Counter Beacon Timestamp Register HL-Byte" name="SCBTSRHL" offset="0xE7" size="1">
                    <bitfield caption="Symbol Counter Beacon Timestamp Register HL-Byte" mask="0xFF" name="SCBTSRHL"/>
                </register>
                <register caption="Symbol Counter Beacon Timestamp Register LH-Byte" name="SCBTSRLH" offset="0xE6" size="1">
                    <bitfield caption="Symbol Counter Beacon Timestamp Register LH-Byte" mask="0xFF" name="SCBTSRLH"/>
                </register>
                <register caption="Symbol Counter Beacon Timestamp Register LL-Byte" name="SCBTSRLL" offset="0xE5" size="1">
                    <bitfield caption="Symbol Counter Beacon Timestamp Register LL-Byte" mask="0xFF" name="SCBTSRLL"/>
                </register>
                <register caption="Symbol Counter Register HH-Byte" name="SCCNTHH" offset="0xE4" size="1">
                    <bitfield caption="Symbol Counter Register HH-Byte" mask="0xFF" name="SCCNTHH"/>
                </register>
                <register caption="Symbol Counter Register HL-Byte" name="SCCNTHL" offset="0xE3" size="1">
                    <bitfield caption="Symbol Counter Register HL-Byte" mask="0xFF" name="SCCNTHL"/>
                </register>
                <register caption="Symbol Counter Register LH-Byte" name="SCCNTLH" offset="0xE2" size="1">
                    <bitfield caption="Symbol Counter Register LH-Byte" mask="0xFF" name="SCCNTLH"/>
                </register>
                <register caption="Symbol Counter Register LL-Byte" name="SCCNTLL" offset="0xE1" size="1">
                    <bitfield caption="Symbol Counter Register LL-Byte" mask="0xFF" name="SCCNTLL"/>
                </register>
                <register caption="Symbol Counter Interrupt Status Register" name="SCIRQS" offset="0xE0" size="1">
                    <bitfield caption="Backoff Slot Counter IRQ" mask="0x10" name="IRQSBO"/>
                    <bitfield caption="Symbol Counter Overflow IRQ" mask="0x08" name="IRQSOF"/>
                    <bitfield caption="Compare Unit 3 Compare Match IRQ" mask="0x07" name="IRQSCP" lsb="1"/>
                </register>
                <register caption="Symbol Counter Interrupt Mask Register" name="SCIRQM" offset="0xDF" size="1">
                    <bitfield caption="Reserved Bit" mask="0xE0" name="Res"/>
                    <bitfield caption="Backoff Slot Counter IRQ enable" mask="0x10" name="IRQMBO"/>
                    <bitfield caption="Symbol Counter Overflow IRQ enable" mask="0x08" name="IRQMOF"/>
                    <bitfield caption="Symbol Counter Compare Match 3 IRQ enable" mask="0x07" name="IRQMCP" lsb="1"/>
                </register>
                <register caption="Symbol Counter Status Register" name="SCSR" offset="0xDE" size="1" ocd-rw="R">
                    <bitfield caption="Reserved Bit" mask="0xFE" name="Res"/>
                    <bitfield caption="Symbol Counter busy" mask="0x01" name="SCBSY"/>
                </register>
                <register caption="Symbol Counter Control Register 1" name="SCCR1" offset="0xDD" size="1">
                    <bitfield caption="Reserved Bit" mask="0xC0" name="Res" lsb="5"/>
                    <bitfield caption="Symbol Counter Beacon Timestamp Mask Register" mask="0x20" name="SCBTSM"/>
                    <bitfield caption="Clock divider for synchronous clock source (16MHz Transceiver Clock)" mask="0x1C" name="SCCKDIV" values="SCCKDIV_BITF"/>
                    <bitfield caption="Enable External Clock Source on PG2" mask="0x02" name="SCEECLK"/>
                    <bitfield caption="Backoff Slot Counter enable" mask="0x01" name="SCENBO"/>
                </register>
                <register caption="Symbol Counter Control Register 0" name="SCCR0" offset="0xDC" size="1">
                    <bitfield caption="Symbol Counter Synchronization" mask="0x80" name="SCRES"/>
                    <bitfield caption="Manual Beacon Timestamp" mask="0x40" name="SCMBTS"/>
                    <bitfield caption="Symbol Counter enable" mask="0x20" name="SCEN"/>
                    <bitfield caption="Symbol Counter Clock Source select" mask="0x10" name="SCCKSEL"/>
                    <bitfield caption="Symbol Counter Automatic Timestamping enable" mask="0x08" name="SCTSE"/>
                    <bitfield caption="Symbol Counter Compare Unit 3 Mode select" mask="0x07" name="SCCMP" lsb="1"/>
                </register>
                <register caption="Symbol Counter Compare Source Register" name="SCCSR" offset="0xDB" size="1">
                    <bitfield caption="Reserved Bit" mask="0xC0" name="Res"/>
                    <bitfield caption="Symbol Counter Compare Source select register for Compare Unit 3" mask="0x30" name="SCCS3" values="SCCS3_BITF"/>
                    <bitfield caption="Symbol Counter Compare Source select register for Compare Unit 2" mask="0x0C" name="SCCS2" values="SCCS2_BITF"/>
                    <bitfield caption="Symbol Counter Compare Source select register for Compare Units" mask="0x03" name="SCCS1" values="SCCS1_BITF"/>
                </register>
                <register caption="Symbol Counter Received Frame Timestamp Register HH-Byte" name="SCRSTRHH" offset="0xDA" size="1">
                    <bitfield caption="Symbol Counter Received Frame Timestamp Register HH-Byte" mask="0xFF" name="SCRSTRHH"/>
                </register>
                <register caption="Symbol Counter Received Frame Timestamp Register HL-Byte" name="SCRSTRHL" offset="0xD9" size="1">
                    <bitfield caption="Symbol Counter Received Frame Timestamp Register HL-Byte" mask="0xFF" name="SCRSTRHL"/>
                </register>
                <register caption="Symbol Counter Received Frame Timestamp Register LH-Byte" name="SCRSTRLH" offset="0xD8" size="1">
                    <bitfield caption="Symbol Counter Received Frame Timestamp Register LH-Byte" mask="0xFF" name="SCRSTRLH"/>
                </register>
                <register caption="Symbol Counter Received Frame Timestamp Register LL-Byte" name="SCRSTRLL" offset="0xD7" size="1">
                    <bitfield caption="Symbol Counter Received Frame Timestamp Register LL-Byte" mask="0xFF" name="SCRSTRLL"/>
                </register>
            </register-group>
