bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644RFR2.xml
                <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1">
                    <bitfield caption="Pin Change Enable Mask" mask="0xFF" name="PCINT" lsb="8"/>
                </register>
                <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1">
                    <bitfield caption="Pin Change Enable Mask" mask="0xFF" name="PCINT" lsb="0"/>
                </register>
                <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
                    <bitfield caption="Reserved Bit" mask="0xF8" name="Res"/>
                    <bitfield caption="Pin Change Interrupt Flags" mask="0x07" name="PCIF"/>
                </register>
                <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x68" size="1">
                    <bitfield caption="Reserved Bit" mask="0xF8" name="Res"/>
                    <bitfield caption="Pin Change Interrupt Enables" mask="0x07" name="PCIE"/>
                </register>
            </register-group>
            <value-group caption="" name="INTERRUPT_SENSE_CONTROL3">
                <value caption="The low level of INTn generates an interrupt request." name="VAL_0x00" value="0x00"/>
                <value caption="Any edge of INTn generates asynchronously an interrupt request." name="VAL_0x01" value="0x01"/>
                <value caption="The falling edge of INTn generates asynchronously an interrupt request." name="VAL_0x02" value="0x02"/>
                <value caption="The rising edge of INTn generates asynchronously an interrupt request." name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="INTERRUPT_REQ_ENABLE_BITF">
                <value caption="All external pin interrupts are disabled." name="VAL_0x00" value="0x00"/>
                <value caption="All external pin interrupts are enabled." name="VAL_0xff" value="0xff"/>
            </value-group>
            <value-group caption="" name="INTERRUPT_EXT_FLAG_BITF">
                <value caption="No edge or logic change on INT7:0 occurred." name="VAL_0x00" value="0x00"/>
                <value caption="A edge or logic change on INT0 occurred and triggered an interrupt request." name="VAL_0x01" value="0x01"/>
                <value caption="..." name="VAL_0x02" value="0x02"/>
                <value caption="A edge or logic change on INT7 occurred and triggered an interrupt request." name="VAL_0x80" value="0x80"/>
            </value-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="The ADC Multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF9"/>
                    <bitfield caption="ADC Left Adjust Result" mask="0x20" name="ADLAR"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
                </register>
                <register caption="ADC Data Register Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
                <register caption="The ADC Control and Status Register A" name="ADCSRA" offset="0x7A" size="1">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
                </register>
                <register caption="The ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="AVDD Supply Voltage OK" mask="0x80" name="AVDDOK"/>
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
                    <bitfield caption="Reference Voltage OK" mask="0x20" name="REFOK"/>
                    <bitfield caption="Analog Channel Change" mask="0x10" name="ACCH"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x08" name="MUX5"/>
                    <bitfield caption="ADC Auto Trigger Source" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER"/>
                </register>
                <register caption="The ADC Control and Status Register C" name="ADCSRC" offset="0x77" size="1">
                    <bitfield caption="ADC Track-and-Hold Time" mask="0xC0" name="ADTHT" values="ANALOG_ADC_TRACK_AND_HOLD_TIME"/>
                    <bitfield caption="Reserved" mask="0x20" name="Res0"/>
                    <bitfield caption="ADC Start-up Time" mask="0x1F" name="ADSUT" values="ANALOG_ADC_STARTUP_TIME"/>
                </register>
                <register caption="Digital Input Disable Register 2" name="DIDR2" offset="0x7D" size="1">
                    <bitfield caption="Reserved Bits" mask="0x80" name="ADC15D"/>
                    <bitfield caption="Reserved Bits" mask="0x40" name="ADC14D"/>
                    <bitfield caption="Reserved Bits" mask="0x20" name="ADC13D"/>
                    <bitfield caption="Reserved Bits" mask="0x10" name="ADC12D"/>
                    <bitfield caption="Reserved Bits" mask="0x08" name="ADC11D"/>
                    <bitfield caption="Reserved Bits" mask="0x04" name="ADC10D"/>
                    <bitfield caption="Reserved Bits" mask="0x02" name="ADC9D"/>
                    <bitfield caption="Reserved Bits" mask="0x01" name="ADC8D"/>
                </register>
                <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
                    <bitfield caption="Disable ADC7:0 Digital Input" mask="0x80" name="ADC7D"/>
                    <bitfield caption="Disable ADC7:0 Digital Input" mask="0x40" name="ADC6D"/>
                    <bitfield caption="Disable ADC7:0 Digital Input" mask="0x20" name="ADC5D"/>
                    <bitfield caption="Disable ADC7:0 Digital Input" mask="0x10" name="ADC4D"/>
                    <bitfield caption="Disable ADC7:0 Digital Input" mask="0x08" name="ADC3D"/>
                    <bitfield caption="Disable ADC7:0 Digital Input" mask="0x04" name="ADC2D"/>
                    <bitfield caption="Disable ADC7:0 Digital Input" mask="0x02" name="ADC1D"/>
                    <bitfield caption="Disable ADC7:0 Digital Input" mask="0x01" name="ADC0D"/>
                </register>
            </register-group>
